institute_message = 'Хорошо! Далее введите ваш институт! 👇'
end_of_registration_message = 'Спасибо за регистрацию! 💖\nВы молодец, держите корону! 👑\nДобро пожаловать в меню! ✨'
course_message = 'Хорошо! Осталось совсем немного! 👌\nВыберите ваш курс:'
group_message = 'У вас отлично получается! 👍\nДалее выберите вашу группу:'
pre_buy_demo_alert = '''\
Спасибо, что захотели поддержать разработчиков!💛\nМы очень стараемся улучшать и совершенствовать нашего бота! 💪
Счёт для оплаты:
'''
tm_title = 'Поддержка разработчиков'
tm_description = '''\
Блин, спасибо, что помогаете нам! 💖💖💖
'''

successful_payment = '''
Ура! 🔥\nПлатеж на сумму `{total_amount} {currency}` совершен успешно! Спасибо, что поддержали разработчиков!💖💖💖
'''
MESSAGES = {
    'pre_buy_demo_alert': pre_buy_demo_alert,
    'tm_title': tm_title,
    'tm_description': tm_description,
    'successful_payment': successful_payment,
}
